spec/cassettes/create_payment_on_successfull_charge/should_create_a_payment_with_reference_id.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_103oL22JANYh9MVFnuF3ndMa
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_ZaKKJ9YpgJPwIZRBGIoYQUXY
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p353 (2013-11-22)","platform":"x86_64-darwin13.0.0","publisher":"stripe","uname":"Darwin
        itadakitekiMacBook-Pro.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan
        16 19:40:37 PST 2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 07 Apr 2014 20:04:32 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1456'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_103oL22JANYh9MVFnuF3ndMa",
          "created": 1396898713,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_103oL22JANYh9MVF6Nbd7dUk",
              "object": "charge",
              "created": 1396898713,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_103oL22JANYh9MVFwaBz9Mjo",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 4,
                "exp_year": 2015,
                "fingerprint": "xtjBEsATD6l3c4KY",
                "customer": "cus_3oL2ehExWX1gPR",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              },
              "captured": true,
              "refunds": [],
              "balance_transaction": "txn_103oL22JANYh9MVF9gCKhc0j",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_3oL2ehExWX1gPR",
              "invoice": "in_103oL22JANYh9MVFFbgcaxOV",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": null
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_3oL2z9gALmsy6j"
        }
    http_version: 
  recorded_at: Mon, 07 Apr 2014 20:04:32 GMT
recorded_with: VCR 2.9.0
